app/controllers/api/v1/locations_controller.rb

SELECT "gps_locations".* FROM "gps_locations" WHERE "gps_locations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        location = Location.find(params[:id])