app/controllers/api/v1/utilities_controller.rb

      def show
        subsection = Utility.find(params[:id])
---
SELECT "utilities".* FROM "utilities" WHERE "utilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]